import streamlit as st
import easyocr
import numpy as np
from PIL import Image
# Вредни Е-номера
harmful_e_numbers = {
"E407": "Карагенан (възпаления, храносмилателни проблеми)",
"Е621": "Натриев глутамат (главоболие, алергии)",
"E262": "Натриев ацетат (дразни стомаха)",
"Е300": "Аскорбинова киселина (в големи дози дразни стомаха)",
"Е330": "Лимонена киселина (уврежда зъбния емайл)",
"E250": "Натриев нитрит (риск от онкологични заболявания)",
"E952": "Цикламат подсладител",
"E471": "Емулгатор",
"E472": "Емулгатор",
}
